  ### Deployment Results ✅

  **JamesHaughey** successfully deployed branch `feature/add-layers` to **production**

  <details><summary>Show Results</summary>

  ```terraform
Acquiring state lock. This may take a few moments...
data.aws_iam_policy_document.base: Reading...
module.iam_role.data.aws_iam_policy_document.assume_role[0]: Reading...
data.aws_iam_policy_document.base: Read complete after 0s [id=1354667103]
module.iam_role.data.aws_iam_policy_document.default[0]: Reading...
module.iam_role.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3644156030]
module.iam_role.data.aws_iam_policy_document.default[0]: Read complete after 0s [id=1354667103]
module.iam_role.data.aws_iam_policy_document.assume_role_aggregated[0]: Reading...
module.iam_role.data.aws_iam_policy_document.assume_role_aggregated[0]: Read complete after 0s [id=3644156030]
module.iam_role.aws_iam_role.default[0]: Refreshing state... [id=elbokade]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

# module.iam_role.aws_iam_policy.default[0] will be created
+ resource "aws_iam_policy" "default" {
    + arn         = (known after apply)
    + description = "S3 List Access"
    + id          = (known after apply)
    + name        = "elbokade"
    + path        = "/"
    + policy      = jsonencode(
          {
            + Statement = [
                + {
                    + Action   = [
                        + "s3:ListBucketVersions",
                        + "s3:ListBucket",
                      ]
                    + Effect   = "Allow"
                    + Resource = "arn:aws:s3:::*"
                    + Sid      = "BaseAccess"
                  },
              ]
            + Version   = "2012-10-17"
          }
      )
    + policy_id   = (known after apply)
    + tags        = {
        + "Name"      = "elbokade"
        + "Namespace" = "elbokade"
      }
    + tags_all    = {
        + "Name"      = "elbokade"
        + "Namespace" = "elbokade"
      }
  }

# module.iam_role.aws_iam_role_policy_attachment.default[0] will be created
+ resource "aws_iam_role_policy_attachment" "default" {
    + id         = (known after apply)
    + policy_arn = (known after apply)
    + role       = "elbokade"
  }

Plan: 2 to add, 0 to change, 0 to destroy.
module.iam_role.aws_iam_policy.default[0]: Creating...
module.iam_role.aws_iam_policy.default[0]: Creation complete after 1s [id=arn:aws:iam::587678272550:policy/elbokade]
module.iam_role.aws_iam_role_policy_attachment.default[0]: Creating...
module.iam_role.aws_iam_role_policy_attachment.default[0]: Creation complete after 0s [id=elbokade-20230226232904937400000001]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```

  </details>